In [5]:
import pandas as pd

In [1]:
data = [[1,2,3], [4,5,6], [7,8,9]]

In [2]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
data[0][0]

1

In [6]:
df1 = pd.DataFrame(data)

In [7]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
index = ['Linha' + str(i) for i in range(3)]

In [9]:
index

['Linha0', 'Linha1', 'Linha2']

In [11]:
df1.index = index

In [12]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [13]:
coluna = ['Coluna' + str(i) for i in range(3)]

In [14]:
df1.columns = coluna

In [15]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9